id: 01f1c934-477b-428f-aa71-88796a867b66
name: Safe Links Click Events Telemetry for Teams
description: >
  Confirm Safe Links outcomes and adoption in Teams by summarizing click events
  from the last 24 hours. Groups clicks by action type to show how many clicks
  were allowed, blocked, or pending verdict, and how many unique users were involved.
severity: Informational
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - UrlClickEvents
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
tags:
  - Teams
  - MDO
  - Safe Links
  - Telemetry
query: |
  // Safe Links Click Events Telemetry for Teams
  // Confirm Safe Links outcomes and adoption in Teams
  // Source: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/safeguarding-microsoft-teams-with-microsoft-defender-for-office-365/4464086
  let lookback = 24h;
  UrlClickEvents
  | where Timestamp > ago(lookback) and Workload == "Teams"
  | summarize Clicks=count(), Users=dcount(AccountUpn) by ActionType
  | order by Clicks desc
kind: Scheduled
entityMappings: []
metadata:
  source:
    kind: Community
  author:
    name: Pierre Thoor
  support:
    tier: Community
